RIET/src/AccumulationRegisters/ItemsWithoutCVCDecision/ItemsWithoutCVCDecision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ItemsWithoutCVCDecision</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ItemsWithoutCVCDecision/RecordSetModule.bsl
Процедура ДобавитьЗапись(ВидДвижения, Период, Item, CustomsBond) Экспорт
	
	Движение = Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период      = Период;  
	Движение.Item        = Item;
	Движение.CustomsBond = CustomsBond;		
	Движение.Ресурс      = 1;
	
КонецПроцедуры
